---
kind: other
id: Properties.T:Autodesk.Revit.DB.HostObject
source: html/0e3ee593-0889-ee44-316c-9d10eaff113e.htm
---
# HostObject Properties

The id of the assembly instance to which the element belongs.